import { formatLocation, type Locations } from "./index";
import { expect, test } from "vitest";

test("同じ都道府県で市区町村が2つ以上あり、そのうち空プロパティがある場合はプロパティを削除。市区町村が一つしかなく、空のプロパティの場合は、location.tsの該当する都道府県の値を入れて補完。市区町村の配列が空の時はlocation.tsの該当する市区町村の値に補完", () => {
  const data: Locations = {
    北海道: {
      札幌市: [
        "中央区南21条西6丁目",
        "中央区南20条西",
        "中央区宮の森二条",
        "中央区北三条西",
      ],
      "": [],
    },
    埼玉県: {
      草加市: [""],
      川口市: ["大字小谷場", "青木", "本町", "朝日", "芝西1丁目"],
    },
    宮城県: {
      "": [],
    },
    千葉県: {
      "": [""],
    },
  };

  const expectedData: Locations = {
    北海道: {
      札幌市: [
        "中央区南21条西6丁目",
        "中央区南20条西",
        "中央区宮の森二条",
        "中央区北三条西",
      ],
    },
    埼玉県: {
      草加市: ["氷川町", "草加二丁目"],
      川口市: ["大字小谷場", "青木", "本町", "朝日", "芝西1丁目"],
    },
    宮城県: {
      仙台市: [
        "宮城野区鶴ヶ谷",
        "太白区長町",
        "青葉区堤通雨宮町",
        "青葉区米ケ袋",
      ],
    },
    千葉県: {
      船橋市: ["印内", "中野木", "夏見"],
      市川市: ["南八幡", "相之川", "大和田三丁目", "入船"],
      千葉市: ["中央区東千葉", "花見川区花園", "稲毛区黒砂台"],
      野田市: ["山崎"],
      松戸市: ["上本郷"],
      習志野市: ["谷津"],
    },
  };

  const formattedData = formatLocation(data);
  expect(formattedData).toEqual(expectedData);
});
